--练习13.1：请编写一个函数，该函数用于进行无符号整型数的取模运算。



--练习13.2：请实现计算Lua语言中整形数所占用位数的不同方法。



--练习13.3：如何判断一个指定的整数是不是2的整数次幂?



--练习13.4：请编写一个函数，该函数用于计算指定整数的汉明权重（一个数的汉明权重（Hamming weight）是其二进制表示中的1的个数）



--练习13.5：请编写一个函数，该函数用于判断指定整数的二进制表示是否为回文数。



--练习13.6：请在Lua语言中实现一个比特数组（bit array），该数组应支持如下操作。
--● newBitArray(n) (创建一个有n个bit的数组)。
--● setBit(a, n, v) (将boolean值v赋值给数组a的第n位)。
--● testBit(a, n) (将第n位的值作为布尔值返回)。



--练习13.7：假设有一个以一系列记录组成的二进制文件，其中的每一个记录的格式为：
--struct Record{
--    int x;
--    char[3] code;
--    float value;
--};
--请编写一个程序，该程序读取这个文件，然后输出value字段的总和。
